dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxGtm_reg.h
/** \brief 9290, TOM2 Channel 10 CCU1 Compare Register */
#define GTM_TOM2_CH10_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF0109290u)

/** \brief 9294, TOM2 Channel 10 CCU0 Counter Register */
#define GTM_TOM2_CH10_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF0109294u)

/** \brief 9298, TOM2 Channel 10 Status Register */
#define GTM_TOM2_CH10_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF0109298u)

/** \brief 929C, TOM2 Channel 10 Interrupt Notification Register */
#define GTM_TOM2_CH10_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010929Cu)

/** \brief 92A0, TOM2 Channel 10 Interrupt Enable Register */
#define GTM_TOM2_CH10_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF01092A0u)

/** \brief 92A4, TOM2 Channel 10 Force Interrupt Register */
#define GTM_TOM2_CH10_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF01092A4u)

/** \brief 92A8, TOM2 Channel 10 Interrupt Mode Register */
#define GTM_TOM2_CH10_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF01092A8u)

/** \brief 92C0, TOM2 Channel 11 Control Register */
#define GTM_TOM2_CH11_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF01092C0u)

/** \brief 92C4, TOM2 Channel 11 CCU0 Compare Shadow Register */
#define GTM_TOM2_CH11_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF01092C4u)

/** \brief 92C8, TOM2 Channel 11 CCU1 Compare Shadow Register */
#define GTM_TOM2_CH11_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF01092C8u)

/** \brief 92CC, TOM2 Channel 11 CCU0 Compare Register */
#define GTM_TOM2_CH11_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF01092CCu)

/** \brief 92D0, TOM2 Channel 11 CCU1 Compare Register */
#define GTM_TOM2_CH11_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF01092D0u)

/** \brief 92D4, TOM2 Channel 11 CCU0 Counter Register */
#define GTM_TOM2_CH11_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF01092D4u)

/** \brief 92D8, TOM2 Channel 11 Status Register */
#define GTM_TOM2_CH11_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF01092D8u)

/** \brief 92DC, TOM2 Channel 11 Interrupt Notification Register */
#define GTM_TOM2_CH11_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF01092DCu)

/** \brief 92E0, TOM2 Channel 11 Interrupt Enable Register */
#define GTM_TOM2_CH11_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF01092E0u)

/** \brief 92E4, TOM2 Channel 11 Force Interrupt Register */
#define GTM_TOM2_CH11_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF01092E4u)

/** \brief 92E8, TOM2 Channel 11 Interrupt Mode Register */
#define GTM_TOM2_CH11_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF01092E8u)

/** \brief 9300, TOM2 Channel 12 Control Register */
#define GTM_TOM2_CH12_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF0109300u)

/** \brief 9304, TOM2 Channel 12 CCU0 Compare Shadow Register */
#define GTM_TOM2_CH12_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF0109304u)

/** \brief 9308, TOM2 Channel 12 CCU1 Compare Shadow Register */
#define GTM_TOM2_CH12_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF0109308u)

/** \brief 930C, TOM2 Channel 12 CCU0 Compare Register */
#define GTM_TOM2_CH12_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010930Cu)

/** \brief 9310, TOM2 Channel 12 CCU1 Compare Register */
#define GTM_TOM2_CH12_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF0109310u)

/** \brief 9314, TOM2 Channel 12 CCU0 Counter Register */
#define GTM_TOM2_CH12_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF0109314u)

/** \brief 9318, TOM2 Channel 12 Status Register */
#define GTM_TOM2_CH12_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF0109318u)

/** \brief 931C, TOM2 Channel 12 Interrupt Notification Register */
#define GTM_TOM2_CH12_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010931Cu)

/** \brief 9320, TOM2 Channel 12 Interrupt Enable Register */
#define GTM_TOM2_CH12_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF0109320u)

/** \brief 9324, TOM2 Channel 12 Force Interrupt Register */
#define GTM_TOM2_CH12_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF0109324u)

/** \brief 9328, TOM2 Channel 12 Interrupt Mode Register */
#define GTM_TOM2_CH12_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF0109328u)

/** \brief 9340, TOM2 Channel 13 Control Register */
#define GTM_TOM2_CH13_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF0109340u)

/** \brief 9344, TOM2 Channel 13 CCU0 Compare Shadow Register */
#define GTM_TOM2_CH13_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF0109344u)

/** \brief 9348, TOM2 Channel 13 CCU1 Compare Shadow Register */
#define GTM_TOM2_CH13_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF0109348u)

/** \brief 934C, TOM2 Channel 13 CCU0 Compare Register */
#define GTM_TOM2_CH13_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010934Cu)

/** \brief 9350, TOM2 Channel 13 CCU1 Compare Register */
#define GTM_TOM2_CH13_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF0109350u)

/** \brief 9354, TOM2 Channel 13 CCU0 Counter Register */
#define GTM_TOM2_CH13_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF0109354u)

/** \brief 9358, TOM2 Channel 13 Status Register */
#define GTM_TOM2_CH13_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF0109358u)

/** \brief 935C, TOM2 Channel 13 Interrupt Notification Register */
#define GTM_TOM2_CH13_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010935Cu)

/** \brief 9360, TOM2 Channel 13 Interrupt Enable Register */
#define GTM_TOM2_CH13_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF0109360u)

